// 1 разобраться с data в authController -> register DONE

// 2 jwt при регистрации DONE
// 3 настроить проверку сущ записанного токена ресета пароля - 
// можно дропать таблицу после того как истечет время токена и делать на фронте кнопку неактивной DONE

//найти как измнить имя файлу без того что бы обновлять его в самом пути

// апдейтнуть создание поста с категориями из другой таблицы

// исправить то что не может неавторизированный что то делать

// можно добавить возможность не писать комментарии под постом

// уточнить по поводу описания категории DONE - его можно добавить в апдейте

// пофиксить айди автора в комменте DONE