// 1 разобраться с data в authController -> register DONE

// 2 jwt при регистрации DONE
// 3 настроить проверку сущ записанного токена ресета пароля - 
// можно дропать таблицу после того как истечет время токена и делать на фронте кнопку неактивной DONE

// 4 найти как измнить имя файлу без того что бы обновлять его в самом пути DONE

// 5 апдейтнуть создание поста с категориями из другой таблицы DONE

// 6 исправить то что не может неавторизированный что то делать DONE

// 7 можно добавить возможность не писать комментарии под постом

// 8 уточнить по поводу описания категории DONE - его можно добавить в апдейте

// 9 пофиксить айди автора в комменте DONE

// 10 мб добавить ответы на комментарии? 

// 11 рейтинг DONE

// 12 сортировки DONE

// 13 фильтры DONE

// 14 блокировка поста -  в принципе актив или неактив DONE

// 15 статус DONE

// 16 админка

// 17 добавить, что если нажимается дизлайк, то убирается лайк и наоборот мб на фронте єто сделаю

// 18  ограничить права админа

// 19 активный или неактивный комментарий

// 20 пупуп, норм же работаем что за хуйня